#+TITLE: kolaBiBot
#+OPTIONS: toc:2 num:nil

** PostgreSQL persistence replacement plan

PostgreSQL is the preferred backend for long-running concurrent bots and multi-account tests. It removes SQLite's single-writer file lock and lets the current SQLAlchemy models use normal multi-connection transactions. It does not remove the need for lane separation: critical lifecycle truth, broad account state, audit, and telemetry should remain logically separated so low-priority writes cannot obscure operator reasoning.

Local Docker target:

#+begin_src bash
docker run --name kolabi-postgres \
  -e POSTGRES_USER=kolabi \
  -e POSTGRES_PASSWORD=kolabi \
  -e POSTGRES_DB=kolabi \
  -p 5432:5432 \
  -v kolabi-postgres-data:/var/lib/postgresql/data \
  -d postgres:16
#+end_src

Repository integration plan:
- Add an optional =docker-compose.postgres.yml= with the same credentials and volume.
- Add =psycopg[binary]= to the development/runtime dependency set used for SQLAlchemy PostgreSQL URLs.
- Keep the existing URL flags unchanged: =--market-db-url=, =--account-db-url=, =--critical-db-url=, =--audit-db-url=, and =--telemetry-db-url=.
- Use URL examples like =postgresql+psycopg://kolabi:kolabi@localhost:5432/kolabi= for all lanes during the first pass; later split schemas if operational clarity requires it.
- Initialise tables through the existing SQLAlchemy metadata path before running feeders. No behavioural migration is required for an empty test DB.
- Smoke test sequence: start PostgreSQL, start public feeder with a PostgreSQL =--db-url=, start private feeder with PostgreSQL =--account-db-url= and =--critical-db-url=, run =rep_xbt.tsv= with PostgreSQL audit/telemetry URLs, then compare lifecycle logs and row counts against the SQLite run.
- Acceptance: no =database is locked= errors, order/fill lifecycle still comes from the critical private lane, audit failures remain non-fatal, and existing SQLite defaults still work for local smoke tests.

Local inspection commands:
#+BEGIN_SRC bash  -i
# list tables
sqlite3 db/pub-futures-demo-PI_XBTUSD.sqlite '.tables'
#+END_SRC

#+RESULTS:
| account_balances     | exchange_orders        | market_snapshots    |
| account_positions    | kraken_orderbook       | order_events        |
| exchange_connections | kraken_orderbook_level | order_runs          |
| exchange_fills       | market_indicators      | raw_exchange_events |
| exchange_instruments | market_levels          |                     |

#+begin_src bash
# inspect all cached instrument rules
sqlite3 db/pub-futures-demo-PI_XBTUSD.sqlite \
  "SELECT symbol, tick_size, contract_size, min_quantity, instrument_type, tradeable, updated_at FROM exchange_instruments ORDER BY symbol;"
#+end_src

#+RESULTS:
| PI_ADAUSD |   |   | 1.0 |   | 1 | 2026-05-14 | 12:48:25.591722 |
| PI_XBTUSD |   |   | 1.0 |   | 1 | 2026-05-14 | 12:48:25.591722 |

#+BEGIN_SRC bash  -i
# inspect one instrument
sqlite3 db/pub-futures-demo-PI_XBTUSD.sqlite \
  "SELECT symbol, tick_size, contract_size, min_quantity, instrument_type, tradeable, updated_at FROM exchange_instruments WHERE symbol = 'PI_XBTUSD';"
#+END_SRC

#+RESULTS:
| PI_XBTUSD |   |   | 1.0 |   | 1 | 2026-05-14 12:48:25.591722 |

